app/controllers/admin/activities_controller.rb

  def show
    @activity = Activity.find(params[:id])
    @bookings = Booking.where(activity_id: params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT 1  [["id", 8]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."activity_id" = $1  [["activity_id", 8]]

  def edit
    @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT 1  [["id", 8]]

  def update
    @activity = Activity.find(params[:id])
    @activity.title = params[:title]
    @activity.description = params[:description]
    @activity.start = DateTime.strptime(params[:date] + params[:time], '%Y-%m-%d%H:%M')
    @activity.location = params[:location]
    @activity.user_id = session[:user_id]
    @activity.save
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "activities" SET "description" = $1, "start" = $2, "location" = $3, "latitude" = $4, "longitude" = $5, "updated_at" = $6 WHERE "activities"."id" = $7

  def hosting
    @activities = Activity.where(user_id: current_user.id)
---
SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = $1  [["user_id", 1]]

  def booked
    @bookings = Booking.where(user_id: current_user.id)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 1]]