app/controllers/activities_controller.rb

SELECT activities.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-37.814107 - activities.latitude) * PI() / 180 / 2), 2) + COS(-37.814107 * PI() / 180) * COS(activities.latitude * PI() / 180) * POWER(SIN((144.96328 - activities.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((activities.longitude - 144.96328) / 57.2957795), ((activities.latitude - -37.814107) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "activities" WHERE (activities.latitude BETWEEN -38.24830234933254 AND -37.37991165066746 AND activities.longitude BETWEEN 144.41366847390967 AND 145.51289152609033 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-37.814107 - activities.latitude) * PI() / 180 / 2), 2) + COS(-37.814107 * PI() / 180) * COS(activities.latitude * PI() / 180) * POWER(SIN((144.96328 - activities.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 30)  ORDER BY distance ASC
---
  def index
    if params[:location].nil?
      @activities = Activity.all