app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "adam@email.com"]]
---
    def create_app_login
      if logged_in?
        redirect_to '/admin/dashboard'
      else
        user = User.find_by(name: params[:name])